benchmarks/nginx_2023-01-29T05:26:29+05:30/erim.log
----0kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /0kb
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1872756
Failed requests:        0
Keep-Alive requests:    1872756
Total transferred:      466316244 bytes
HTML transferred:       0 bytes
Requests per second:    31212.58 [#/sec] (mean)
Time per request:       3.204 [ms] (mean)
Time per request:       0.032 [ms] (mean, across all concurrent requests)
Transfer rate:          7589.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0     249
Processing:     0    3   0.5      3     195
Waiting:        0    3   0.5      3     195
Total:          0    3   1.7      3     249

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      3
  99%      3
 100%    249 (longest request)
----1kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /1kb
Document Length:        1024 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1746386
Failed requests:        0
Keep-Alive requests:    1746386
Total transferred:      2231881308 bytes
HTML transferred:       1788299264 bytes
Requests per second:    29106.42 [#/sec] (mean)
Time per request:       3.436 [ms] (mean)
Time per request:       0.034 [ms] (mean, across all concurrent requests)
Transfer rate:          36326.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0     252
Processing:     0    3   0.6      3     172
Waiting:        0    3   0.6      3     172
Total:          0    3   1.7      3     252

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      3
  98%      4
  99%      4
 100%    252 (longest request)
----2kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /2kb
Document Length:        2048 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1703786
Failed requests:        0
Keep-Alive requests:    1703786
Total transferred:      3922115372 bytes
HTML transferred:       3489353728 bytes
Requests per second:    28396.43 [#/sec] (mean)
Time per request:       3.522 [ms] (mean)
Time per request:       0.035 [ms] (mean, across all concurrent requests)
Transfer rate:          63836.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.6      0     249
Processing:     0    4   0.6      4     177
Waiting:        0    4   0.6      4     177
Total:          0    4   1.8      4     253

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    253 (longest request)
----4kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /4kb
Document Length:        4096 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1652877
Failed requests:        0
Keep-Alive requests:    1652877
Total transferred:      7191667827 bytes
HTML transferred:       6770184192 bytes
Requests per second:    27547.94 [#/sec] (mean)
Time per request:       3.630 [ms] (mean)
Time per request:       0.036 [ms] (mean, across all concurrent requests)
Transfer rate:          117051.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0     252
Processing:     0    4   0.6      4     175
Waiting:        0    4   0.6      4     175
Total:          0    4   1.8      4     252

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    252 (longest request)
----8kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /8kb
Document Length:        8192 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      1524774
Failed requests:        0
Keep-Alive requests:    1524774
Total transferred:      12879765978 bytes
HTML transferred:       12490948608 bytes
Requests per second:    25412.89 [#/sec] (mean)
Time per request:       3.935 [ms] (mean)
Time per request:       0.039 [ms] (mean, across all concurrent requests)
Transfer rate:          209631.51 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.7      0     251
Processing:     0    4   0.6      4     174
Waiting:        0    4   0.6      4     174
Total:          0    4   1.8      4     251

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      4
  99%      4
 100%    251 (longest request)
----16kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /16kb
Document Length:        16384 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      984876
Failed requests:        0
Keep-Alive requests:    984876
Total transferred:      16388336640 bytes
HTML transferred:       16136208384 bytes
Requests per second:    16414.60 [#/sec] (mean)
Time per request:       6.092 [ms] (mean)
Time per request:       0.061 [ms] (mean, across all concurrent requests)
Transfer rate:          266737.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.2      0     252
Processing:     0    6   0.8      6     180
Waiting:        0    6   0.8      6     180
Total:          0    6   2.3      6     257

Percentage of the requests served within a certain time (ms)
  50%      6
  66%      6
  75%      6
  80%      6
  90%      6
  95%      6
  98%      6
  99%      6
 100%    257 (longest request)
----32kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /32kb
Document Length:        32768 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      687784
Failed requests:        0
Keep-Alive requests:    687784
Total transferred:      22713378816 bytes
HTML transferred:       22537306112 bytes
Requests per second:    11463.06 [#/sec] (mean)
Time per request:       8.724 [ms] (mean)
Time per request:       0.087 [ms] (mean, across all concurrent requests)
Transfer rate:          369683.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.7      0     257
Processing:     0    9   0.9      9     178
Waiting:        0    9   0.9      9     178
Total:          0    9   2.7      9     257

Percentage of the requests served within a certain time (ms)
  50%      9
  66%      9
  75%      9
  80%      9
  90%      9
  95%      9
  98%      9
  99%      9
 100%    257 (longest request)
----64kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /64kb
Document Length:        65536 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      435244
Failed requests:        0
Keep-Alive requests:    435244
Total transferred:      28636008492 bytes
HTML transferred:       28524150784 bytes
Requests per second:    7254.06 [#/sec] (mean)
Time per request:       13.785 [ms] (mean)
Time per request:       0.138 [ms] (mean, across all concurrent requests)
Transfer rate:          466080.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   3.4      0     260
Processing:     0   14   1.2     14     196
Waiting:        0   14   1.2     14     196
Total:          0   14   3.6     14     272

Percentage of the requests served within a certain time (ms)
  50%     14
  66%     14
  75%     14
  80%     14
  90%     14
  95%     14
  98%     14
  99%     14
 100%    272 (longest request)
----128kb
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        nginx/1.12.1
Server Hostname:        localhost
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH P-256 256 bits
TLS Server Name:        localhost

Document Path:          /128kb
Document Length:        131072 bytes

Concurrency Level:      100
Time taken for tests:   60.000 seconds
Complete requests:      254537
Failed requests:        0
Keep-Alive requests:    254537
Total transferred:      33428344210 bytes
HTML transferred:       33362673664 bytes
Requests per second:    4242.28 [#/sec] (mean)
Time per request:       23.572 [ms] (mean)
Time per request:       0.236 [ms] (mean, across all concurrent requests)
Transfer rate:          544081.06 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   4.5      0     261
Processing:     0   23   1.3     23     179
Waiting:        0   23   1.3     23     179
Total:          0   24   4.5     23     277

Percentage of the requests served within a certain time (ms)
  50%     23
  66%     23
  75%     24
  80%     24
  90%     24
  95%     24
  98%     24
  99%     24
 100%    277 (longest request)